[
  {
    "id": "3926911273",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Marketing and Sales"
      },
      {
        "title": "Industries",
        "value": "Hospitality"
      }
    ],
    "company": "Accor",
    "location": "Beirut Beirut Governorate Lebanon",
    "title": "Marketing Executive",
    "link": "https://fr.linkedin.com/company/accor?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "1 month ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "Company Description\n\nJoin us at Accor, where life pulses with passion!\n\nAs a pioneer in the art of responsible hospitality, the Accor Group gathers more than 45 brands, 5,600 hotels, 10,000 restaurants, and lifestyle destinations in 110 countries. While each brand has its own personality, where you will be able to truly find yourself, they all share a common ambition: to keep innovating and challenging the status-quo.\n\nBy joining us, you will become a Heartist®, because hospitality is, first and foremost, a work of heart.\n\nYou will join a caring environment and a team where you can be all you are. You will be in a supportive place to grow, to fulfil yourself, to discover other professions and to pursue career opportunities, in your hotel or in other hospitality environments, in your country or anywhere in the world!\n\nYou will enjoy exclusive benefits, specific to the sector and beyond, as well as strong recognition for your daily commitment.\n\nEverything you will do with us, regardless of your profession, will offer a deep sense of meaning, to create lasting, memorable and impactful experiences for your customers, for your colleagues and for the planet.\n\nHospitality is a work of heart,\n\nJoin us and become a Heartist®.\n\nJob Description\n\n\n*  Design and execute both online and offline marketing strategies to increase visibility, brand reach and achieve the objectives and KPIs set at the business level.\n*  Coordinate and review the digital marketing strategy as well as the management of content in social media of the assigned hotel following the brand standards as well as the principles and line of communication established in the company and based on the strategy set in the annual social media plan\n*  Coordinate and manage the relationship with agencies and third parties, such as, among others, advertising, design, event management, digital marketing agencies, ensuring the correct implementation based on the established marketing strategy and plans.\n*  Control the creation and design of all media and branding materials, both printed and digital, ensuring that they are produced following the standards and\n*  Control marketing budget spend: management of purchase orders, invoices, supplier budgets, and production orders.\n*  Management of databases and launch of newsletters and promotional and brand communication actions.\n*  Work in perfect communication with colleagues, superiors and subordinates, ensuring effective, truthful and fluid communication in all directions.\n*  Implementation of branding and performance campaigns as well as activation of inbound and outbound marketing actions.\n*  Coordinate the creation and design of social media content in various formats and supports.\n*  Supervise the corporate image policy and brand standards applied to the external and internal content of all communication platforms and media of each hotel and brand. At the same time, coordinate the production of photographic and video reports following the corresponding brand standards and manuals.\n\n\n\nQualifications\n\n\n* University degree in Marketing, Business Administration, Advertising and Public Relations or similar\n* Excellent communication and teamwork skills.\n* Proven experience in the area of Communication and Marketing, preferably in the hotel industry.\n* Analytical skills to evaluate campaign performance and adjust strategies as needed.\n* Demonstrable ability to multitask and meet deadlines\n* Good ability to organize and prioritize tasks\n* Professional knowledge of MS Office.\n* Problem-solving mindset\n* Proactive attitude with the ability to manage varied tasks and projects simultaneously and with different execution deadlines"
  },
  {
    "id": "3921349772",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Associate"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Marketing"
      },
      {
        "title": "Industries",
        "value": "Non-profit Organizations and Primary and Secondary Education"
      }
    ],
    "company": "CXG",
    "location": "Beirut Beirut Governorate Lebanon",
    "title": "Marketing and Communications Associate",
    "link": "https://ae.linkedin.com/company/cxgroup?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "1 month ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "We are growing! We are currently looking to hire a Marketing and Communications Associate to work with us remotely from Lebanon!\n\nIf you want to gain experience working with premium and luxury brands, this position provides you with a first-row seat. The Marketing and Communications Associate reports to the Chief Marketing Officer, who is based in Dubai. You will aid in and oversee the digital marketing initiatives, working closely with the Content managers and other peers, helping execute marketing strategies, and pushing content. You will gain broad experience in various aspects of marketing and work in a global-based organization.\n\nWho we are:\n\nFounded in 2006, our story started with two entrepreneurs. Today, we're proud to be a global business. From Shanghai to Paris, we have 12 offices and operate across four continents in 70 countries. We are home to over 160 professionals from around the world, working together to serve more than 200 luxury clients.\n\nAt CXG, we love to evolve, elevate, and transform experiences while bringing brand promises to life. We offer strategic solutions that impact performance and elevate the customer experience of some of the world's most iconic premium and luxury brands.\n\nWhat you will be doing:\n\nUnder the guidance of the Content Managers, the Marketing and Communications Associate is responsible for executing and tracking marketing strategies and activations across various digital channels.\n\nHe/she will monitor and manage CXG's overall marketing execution, including internal and external client-facing communication.\n\nScope:\n\n1- Communication and Campaign Management:\n\n\n* Oversee & create EDM (email and newsletters), social media and internal campaign strategies in coordination with the Content Manager\n* Assist in the creation of circulars, mock-ups, and email campaigns (MailChimp Newsletters)\n* Assist in the distribution or delivery of marketing materials\n* Perform marketing reporting and data analysis from paid digital campaigns related to platforms such as LinkedIn and Meta\n\n\n\n\n2- Internal Communication:\n\n\n* Support in keeping all employees informed and engaged by communicating through several internal channels, including Yammer, Teams, SharePoint, email bulletins, and regular newsletters\n* Support with the timely execution of the internal communications strategy and plan\n* Ensure that the sales team is well informed about CXG's digital marketing goals and initiatives and encourage deeper colleague involvement\n* Participate in other marketing department initiatives as required, including internal communications, sales tools, events, etc\n* Constantly seek ways to improve and increase the marketing department's influence and CXG brand awareness\n\n\n\n\n3- Performance and Marketing Optimization:\n\n\n* Assist in the monthly update of the Marketing report, ensuring timely completion of all reporting across various aspects\n* Provide continuous training and updates on SEO tasks within WordPress and HubSpot platforms\n\n\n\n\n4- Marketing Administration:\n\n\n* Maintain organized file systems and manage SharePoint for the Marketing team\n* Handle supplier invoices and purchase orders and update the marketing budget accordingly\n\n\n\n\nRequirements\n\nWhat you will bring along:\n\nYou bring to this position attention and accuracy for details that you support by:\n\n\n* Bachelor's Degree in Marketing, or a relevant field\n* Ability to write effective copy is a necessity\n* An international mindset, sensitivity to cross-cultural differences, and enthusiasm to work with people from different cultures and parts of the world\n* Attention to detail and excellent project management skills\n* A fast learner, curious, driven to new things, and taking on challenges\n* Strong communication skills\n* Advanced user of Microsoft Word, PowerPoint, and Excel. Design skills (Illustrator, PS) are a big plus\n* Reliable and able to work remotely without any supervision and deliver on KPIs and on time\n\n\n\n\nKey Competencies\n\n\n* Ability to work under pressure and manage stress\n* Time management skills\n* Project management skills\n* Analytical thinking\n* Problem-solving\n* Interpersonal skills\n* Attention to details\n* Integrity\n* Reliability\n* Proactivity and Initiative\n* Team player\n\n\n\nIf you have what we are looking for, please make sure to attach your updated resume with your contact details. Should your profile fit the requirements for the role, we will get in touch with you to get a deeper understanding of your profile, to discuss the role in more detail and potential next steps.\n\nTo know more about us, please visit our website: https://www.cxg.com"
  },
  {
    "id": "3924715107",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Marketing"
      },
      {
        "title": "Industries",
        "value": "Hospitality"
      }
    ],
    "company": "Rotana Hotels & Resorts",
    "location": "Lebanon",
    "title": "Marketing & Communications - Marketing Executive",
    "link": "https://www.linkedin.com/company/rotana-hotels-resorts?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "1 week ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "Job Description\n\nJob Summary-\n\nThe Marketing Executive will be responsible for developing and implementing marketing and communication strategies to promote the company's products or services. This role will involve creating marketing campaigns, analyzing market trends, and managing the company's digital presence.\n\nJob Responsibility-\n\n\n*  Develop and implement marketing campaigns to promote products or services\n*  Conduct market research to identify trends and opportunities\n*  Manage the company's social media platforms including content creation and engagement\n*  Analyze marketing data and metrics to track the effectiveness of campaigns\n*  Collaborate with internal teams to create promotional materials and strategies\n\n\n\nCandidate Requirements-\n\n\n*  Bachelor's degree in Marketing, Communications, or related field\n*  Proven experience in marketing, communications, or a related role\n*  Strong written and verbal communication skills\n*  Proficiency in digital marketing tools and platforms\n*  Ability to work in a fast-paced environment and meet deadlines\n\n\n\nSkills\n\nSkills-\n\n\n*  Strong communication skills\n*  Excellent writing and editing abilities\n*  Knowledge of digital marketing techniques and tools\n*  Proficiency in social media platforms\n*  Ability to create and execute marketing campaigns\n*  Analytical skills for measuring campaign effectiveness\n*  Creative thinking and problem-solving capabilities\n*  Strong project management skills\n*  Ability to work well in a team and independently\n*  Familiarity with market research and trends in the industry"
  },
  {
    "id": "3941091860",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Associate"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Management, Business Development, and Project Management"
      },
      {
        "title": "Industries",
        "value": "Retail and Internet Marketplace Platforms"
      }
    ],
    "company": "noon",
    "location": "Lebanon",
    "title": "Onsite Associate",
    "link": "https://sa.linkedin.com/company/nooncom?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "1 week ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "Who are we?noon.com is a technology leader with a simple mission: to be the best place to buy and sell things. In doing this we hope to accelerate the digital economy of the Middle East, empowering regional talent and businesses to meet the full range of consumers' online needs.\nnoon’s fastest hyper-local delivery platform, noon in minutes offers a localized assortment of FMCG & grocery products with delivery within 15-minutes. Currently live across Downtown Dubai, Bur Dubai, Business Bay, and Dubai Marina, noon in minutes aims to expand across the city in the coming months, offering thousands of products to customers in record time. \nWe are creating the Middle East’s local digital champion and are looking for world-class talent to join our team.\nWhat you'll do:\n* Work on one of the biggest ecommerce platforms in the region\n* Become the owner of the onsite platform experience from a customer perspective for specific categories \n* Liaise with multiple teams such as creatives, marketing, and development to manage the entire process and cycle of deploying and maintaining the most optimized customer journey \n* Conduct regular and thorough quality checks on the platform to ensure the best customer experience\n* Manage any changes required on the platform for specific categories in order to best optimize the customer experience\n* Work closely with the commercial team to help provide deals/offers for campaigns in addition to working with them for stock selection \n\n\nWhat you'll need:\n* Bachelors in Business Administration or a similar field\n* Fresh or recent graduate, with a strong desire and passion for e-commerce \n* Strong project management, problem-solving and organizational skills \n* An individual who works collaboratively and is comfortable working in a dynamic and fast paced environment in a volatile industry\n* Comfortable in a fast-paced, multi-tasked and high energy environment\n* Outstanding verbal and written communication and collaboration skills\n* History of teamwork and willingness to roll up one's sleeves to get the job done\n* Aptitude for organization, flexibility and producing results\n* Experience working in a similar or related role\n* Arabic speaking skills a plus \n\n\nWho will excel?We’re looking for candidates who thrive in a fast-paced, dynamic start-up environment. We’re searching for problem solvers, people who operate with a bias for action and have a deep understanding of the importance of resourcefulness over reliance.\nCandor is our only default. Demanding unequivocal high standards should be non-negotiable because quality matters. We want people who are radically candid, cohorts who commit to settling for nothing but the best - in hiring, in accepting work from colleagues, and in your own work.\nOurs is not an easy mission, but it is a meaningful one. Every hire must actively raise the bar of talent in the company to help us reach our vision."
  },
  {
    "id": "3940344283",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Associate"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Marketing"
      },
      {
        "title": "Industries",
        "value": "Retail Luxury Goods and Jewelry"
      }
    ],
    "company": "ELIE SAAB",
    "location": "Beirut Beirut Governorate Lebanon",
    "title": "Social Media Specialist",
    "link": "https://fr.linkedin.com/company/elie-saab?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "4 weeks ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "The Social Media Specialist is responsible to execute a strategy and content calendar that speaks to our products, and to support an efficient functioning of all social media channels. She/he will produce platform-specific content and ensure a timely calendar while staying up to date with all updates.\nResponsibilities\n* Execute the strategy and the planning for ELIE SAAB social media channels, including daily posts, platform management, and customer engagement.\n* Develop and build out a brand presence on new social media platforms for the brand. · Own and build out social media content publishing calendar.\n* Maintain a consistent voice, personality, and look and feel for the brand across all social media channels.\n* Plan and oversee all paid social campaigns, including partnerships with influencers. · Collaborate with internal stakeholders to create platform specific content.\n* Engage with social media community through authentic conversations and ensure brand-related questions, comments, and opportunities are addressed with speed, good judgment, and in alignment with the brand voice. Perform other job related duties.\n\n\nQualifications:Academic Qualifications:\n* Bachelor’s degree in Marketing, Communication or Media Studies.\n\nExperience:\n* 3 to 4 years of relevant experience; preferably in the Luxury Fashion Industry.\n\nCompetencies:\n* Adaptability & Flexibility Confidentiality & Work Ethics Solid familiarity with social media platform. Data driven & results oriented. Communication skills. Creative thinking. Team player and adapt to changing environment. Attention to details."
  },
  {
    "id": "3966710677",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Associate"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Sales, Business Development, and General Business"
      },
      {
        "title": "Industries",
        "value": "Manufacturing, Food and Beverage Services, and Tobacco Manufacturing"
      }
    ],
    "company": "JTI (Japan Tobacco International)",
    "location": "Beirut Beirut Governorate Lebanon",
    "title": "Trade Marketing Representative",
    "link": "https://ch.linkedin.com/company/jti?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "2 days ago",
    "numberOfApplicants": "37 applicants",
    "description": "At JTI we celebrate differences, and everyone truly belongs. 46,000 people from all over the world are continuously building their unique success story with us. 83% of employees feel happy  working at JTI.\n\nTo make a difference with us, all you need to do is bring your  human best.\n\nWhat will your story be? Apply now!\n\nLearn more jti.com\n\nTrade Marketing Representative\n\nWhat This Position Is About – Purpose\n\nIn this role, you will be responsible for achieving and maintaining targeted product visibility and Share of Space by identifying prime positions. Identify and communicate outlets' needs for POS material. Ensure effective placement of permanent and temporary POSM and promotional display materials. Responsible for handling the consumer and trade marketing programs.\n\nWhat Will You Do - Responsibilities\n\nRoute Planning and Execution\n\nWork under a pre-determined route plan and develop efficient route plans in alignment with the TMS.\n\nEnsure the availability and visibility of JTI brands in designated channels/route plans.\n\nCollaborate closely with the TMS on a daily basis to optimize route effectiveness.\n\nMake It Count Focus on maximizing efficiency and effectiveness in route planning and execution.\n\nIn-Store Promotion and POSM Management \n\nAnalyze accounts to increase shop share through in-store promotions or obtain a more suitable location within the store.\n\nEnsure planograms are implemented according to set directions.\n\nManage visibility contracts in the trade (up to a certain amount and with the supervisor's approval).\n\nMaintain POSM (Point of Sale Materials) in optimal condition and contribute to planning and executing all merchandising and marketing activities to achieve POSM objectives.\n\nMaintain fresh stock in trade according to the FIFO rule.\n\nEnsure the data in the merchandising app is correct and up to date, using the app daily to track and report merchandising activities.\n\nShape Tomorrow, Today Innovate and adapt promotional strategies to enhance brand presence and sales.\n\nMarket Intelligence and Competitor Analysis \n\nMonitor and report on all competitor activities, gathering and disseminating accurate and timely market and intelligence information on JTI and competitors' activities.\n\nWelcome Challenge Proactively seek and analyze market intelligence to stay ahead of competitors and drive continuous improvement.\n\nRelationship Building \n\nEstablish and maintain close contact with key stakeholders (retailer owners and managers) to support the region in meeting its objectives in terms of availability, share of market (SOM), market information, and promotion programs.\n\nStart With Us Build strong relationships and collaborate seamlessly across teams to achieve shared goals.\n\nConsumer Activities and Outlet Management \n\nSelect and manage appropriate outlets for conducting \"121\" consumer activities to enhance brand engagement and sales.\n\nMake It Count Ensure all consumer activities are effectively planned and executed to maximize impact.\n\nWho Are We Looking For - Requirements\n\n\n* Preferably University degree in Business Administration or equivalent\n* Preferably 2-3 years experience in sales & distribution/channel management / Implementation of consumer and Trade Marketing Plans\n* Experience in Field activity execution; Field intelligence; data gathering; reporting \n* Negotiation skills and a deep knowledge of customer service \n\n\n\nWhat Are The Next Steps – Recruitment Process\n\nThank you very much for your interest in the role. You are welcome to apply.\n\nWe provide feedback to all candidates.\n\nAre you ready to join us? Build your success story at JTI. Apply now!\n\nNext Steps \n\nAt JTI, we strive to create a diverse and inclusive work environment. As an equal-opportunity employer, we welcome applicants from all backgrounds. We are committed to providing reasonable adjustments to applicants with special needs. If you require any accommodations, please let the Talent Advisor know during the selection process."
  },
  {
    "id": "3961639722",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Contract"
      },
      {
        "title": "Job function",
        "value": "Marketing and Sales"
      },
      {
        "title": "Industries",
        "value": "Marketing Services"
      }
    ],
    "company": "Project Growth",
    "location": "Beirut Beirut Governorate Lebanon",
    "title": "Social Media Manager",
    "link": "https://www.linkedin.com/company/our-project-growth?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "1 week ago",
    "numberOfApplicants": "95 applicants",
    "description": "Our client is a vibrant platform dedicated to promoting and supporting Asian-founded businesses across various industries. This initiative aims to amplify the visibility of Asian entrepreneurs and their contributions to the global market. They are seeking a creative and organized Social Media Manager to enhance their online presence and engage with a diverse and active community.\n\nThis role is perfect for someone with a passion for social media, a knack for creating visually appealing and compelling content, and the ability to communicate effectively across digital platforms.\n\nLocation: Fully-Remote (Work from Home), 9 AM - 5 PM EST\n\nKey Responsibilities:\n\n\n* Content Calendar Development: Strategically plan and organize a content calendar to ensure consistent and timely posting across all social media platforms. \n* Graphic and Video Content Creation: Use tools like Canva and CapCut to create engaging graphics, reels, and shorts that resonate with the audience and promote the brand's mission. \n* Social Media Posting: Manage the scheduling and posting of all social media content, ensuring that it aligns with the overall marketing strategy and community engagement goals. \n* Community Engagement: Actively respond to comments and direct messages, fostering a positive and supportive online community. \n* Brand Representation: Ensure all content reflects the brand's values and effectively communicates the significance of Asian-founded businesses. \n\n\n\nWhat Success Looks Like:\n\n\n* Enhanced Engagement: Through creative and strategic content, you have significantly increased engagement rates and follower growth across all platforms. \n* Consistent Brand Messaging: You have maintained a cohesive and compelling brand voice across all content, enhancing the company's identity and mission. \n* Strong Community Connections: You have built and maintained strong relationships within the community, evidenced by active interactions and positive feedback on social media. \n\n\n\nQualifications:\n\n\n* Social Media Expertise: Proven experience managing social media accounts, with a strong ability to engage and grow an online audience. \n* Content Creation Skills: Proficiency in Canva and CapCut for creating visually appealing graphic and video content. Proficiency in Adobe Premiere preferred, but not required. \n* Organizational Skills: Highly organized with the ability to manage content calendars and multitask effectively as well as quick response to emails. \n* Communication Skills: Excellent written and verbal communication skills, with fluency in English and the ability to interact positively with followers. \n* Cultural Sensitivity: Understanding of and respect for cultural nuances, with a commitment to promoting diversity and inclusion. \n\n\n\nThis role offers an exciting opportunity for a Social Media Manager to play a pivotal role in a platform that celebrates and supports Asian entrepreneurship. If you are passionate about social media, enthusiastic about promoting cultural diversity, and skilled in creating engaging digital content, we invite you to apply and contribute to a meaningful cause.\n\nApplication Process:\n\nTo be considered for this role these steps need to be followed:\n\n\n* Fill in the application form\n* Record a video showcasing your skill sets"
  },
  {
    "id": "3964305744",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Sales and Business Development"
      },
      {
        "title": "Industries",
        "value": "Advertising Services, Media Production, and Online Audio and Video Media"
      }
    ],
    "company": "Memac Ogilvy",
    "location": "Beirut Beirut Governorate Lebanon",
    "title": "Social Media Account Executive - Beirut, Lebanon",
    "link": "https://ae.linkedin.com/company/memacogilvy?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "3 days ago",
    "numberOfApplicants": "109 applicants",
    "description": "Our Vision\n\nOur vision is to inspire brands and people to impact the world. To create big ideas that make a significant contribution to the planet, society, and the bottom line. We believe in today’s world this is the best way for our clients to achieve sustainable growth.   \n\nWe achieve this by breaking down the barriers that restrict talent and ideas, we call this Borderless Creativity.        \n\nThis is why our teams work fluidly across 5 capabilities Advertising, Experience, PR, Consulting and Health.   This allows us to not only operate but also innovate at the intersection of capabilities and talent.  We believe impact and magic lie at this intersection.   Ogilvy scales this by seamlessly connecting and accessing the deep cultural expertise of 132 offices in 83 countries.   \n\nOur mission: We inspire brands and people to impact the world\n\nHow we do it: We innovate and operate at the intersection of people and capabilities\n\nWhat we do: Borderless creativity\n\nToday, Ogilvy is recognized as the world’s leading creative agency. We are also one of the most effective networks globally.\n\nAbout Memac Ogilvy\n\nMemac Ogilvy is one of the leading creative networks in MENA with its flagship office in the UAE and a strong local footprint in the GCC and North Africa. It is part of the formidable worldwide WPP & Ogilvy network. It’s the only truly integrated comms network – with Consulting, Advertising- Brand & Content, PR, Experience & Health under 1 P&L and a single leadership. Memac Ogilvy is the most integrated modern creative and effective partner for client growth in MENA. We inspire brands and people to impact the world. We deliver on this by combining expert and new capabilities for modern marketing solutions, with solid project management expertise for agile and effective delivery as well as a thorough and passionate People agenda.\n\nThe agency is the most awarded Middle Eastern agency in Cannes as well as a big winner at the local award show Lynx. It has around 500 staff members.\n\nWhat We're Looking For\n\nWe are seeking a dynamic and proactive Social Media Account Executive to join our team. The ideal candidate will have a strong technical background in social media, experience managing multiple channels with distinct content strategies, and an understanding of the Iraqi market to ensure cultural relevance. This role requires excellent organizational, time management, and communication skills to succeed in a fast-paced environment.\n\nTo Succeed In This Role, You Need To\n\n\n* Social Media Strategy: Assist in developing and implementing social media strategies across multiple platforms to enhance brand visibility and engagement.\n* Content Creation: Collaborate with the creative team to ideate, plan, and create engaging content tailored to each social media channel.\n* Channel Management: Manage and execute social media campaigns across various platforms, ensuring consistency and alignment with overall brand strategies.\n* Moderation and Community Management: Monitor social media channels, respond to comments and messages, and engage with the audience to build a strong online community.\n* Reporting and Analysis: Track, analyze, and report on social media performance metrics to inform future strategies and improve ROI.\n* Cultural Relevance: Leverage knowledge of the Iraqi market to ensure all social media content is culturally relevant and resonates with the target audience.\n* Client Interaction: Maintain effective communication with clients, providing regular updates, reports, and insights to foster strong client relationships\n\n\n\nQualifications\n\n\n* Experience: Previous experience in managing multiple social media channels with distinct content strategies simultaneously.\n* Technical Knowledge: Proficient in the full spectrum of social media activities, including ideation, planning, posting, moderation, community management, and reporting.\n* Market Understanding: Knowledge and hands-on experience in the Iraqi market is a significant plus.\n* Skills: Strong organizational, time management, and communication skills, both internally and client-facing.\n* Creativity: Ability to think creatively and develop unique content ideas that drive engagement and brand loyalty.\n* Adaptability: Ability to adapt to changing trends and technologies in the social media landscape.\n\n\n\nMemac Ogilvy inspires brands and people to impact the world. We exist to create iconic, culture-changing, value-driven ideas for our clients. \n\nBorderless Creativity is our lifeblood. We operate, innovate, and create at the intersection of our talented people, across advertising disciplines such as strategic thinking and distinctive idea creation, through a social-first approach — alongside our wider Memac Ogilvy family of Advertising, Experience, Health, Consulting and PR. Never have there been more opportunities available to communicate incredible ideas, impact culture, and influence consumer behaviour. Paid advertising is a consistent, regular and controllable way of getting a business and brand’s core message in front of consumers in a way that no other medium can. Creativity is our greatest differentiator as we transcend the status quo and shift culture.\n\nAt Ogilvy, our people are at the heart of what we do: a creative agency that sparks game-changing ideas across culture and business through collaboration, integrity, and a celebration of self-expression.\n\nWe believe in building powerful teams with purpose. This means hiring and nurturing talent across all races, ethnicities, religions, abilities, sexual orientation, and gender identities – and we relentlessly curate transformative initiatives that make our commitment to fairness, and equity a reality.\n\nOur ultimate mission is to leave a positive impact on the world, creating a better future for all, while supporting and uplifting the global communities we serve. This is central to our mantra of Borderless Creativity.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran."
  },
  {
    "id": "3787768476",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Marketing and Sales"
      },
      {
        "title": "Industries",
        "value": "Internet Publishing"
      }
    ],
    "company": "Presentail",
    "location": "Achrafieh Beirut Governorate Lebanon",
    "title": "Marketing Associate",
    "link": "https://lb.linkedin.com/company/presentail?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "6 months ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "Presentail is looking for a Marketing associate to join our team in our Achrafieh office. The Marketing associate will create and distribute positive branding messages and collateral for the company's products and services.\n\nThe ideal person for this position has a dynamic personality and is passionate about sales and marketing. This candidate should have previous relevant experience and be interested in learning new sales techniques. To succeed in this role, he/she should be goal-driven and have strong negotiation skills.\n\nResponsibilities:\n\n\n* Campaign Execution: Implement marketing campaigns\n* Analytics: Analyze campaign performance\n* Content Creation: Develop marketing materials\n* Social Media Management: Maintain and engage on social platforms\n* Research: Stay informed on industry and market trends\n* Collaboration: Work with team members and stakeholders\n* Event Support: Assist in organizing and executing events\n* Customer Communication: Support customer communications\n* Monitor actionable metrics – Forecast and analyze sales trends, marketing strategies, and product performance. Prepare and present reports summarizing information while making recommendations based on analysis. Perform other duties as assigned\n\n\n\nRequirements:\n\n\n* Bachelor’s degree in Marketing, Statistics, Business or a related field required\n* 1-3 years of related experience in business, promotional sales, customer service or a related field preferred\n* Excellent verbal and written communication skills\n* Excellent sales and customer service skills\n* Strong analytical and problem-solving skills\n* Proficient with Microsoft Office Suite, meta business suite, Google ads and Linkedin ads\n\n\n\nPowered by JazzHR\n\npA7zzle7lo"
  },
  {
    "id": "3954366952",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Design, Art/Creative, and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Advertising Services, Media Production, and Online Audio and Video Media"
      }
    ],
    "company": "Memac Ogilvy",
    "location": "Beirut Beirut Governorate Lebanon",
    "title": "Designer - Beirut, Lebanon",
    "link": "https://ae.linkedin.com/company/memacogilvy?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "2 weeks ago",
    "numberOfApplicants": "46 applicants",
    "description": "Our Vision\n\nOur vision is to inspire brands and people to impact the world. To create big ideas that make a significant contribution to the planet, society, and the bottom line. We believe in today’s world this is the best way for our clients to achieve sustainable growth.   \n\nWe achieve this by breaking down the barriers that restrict talent and ideas, we call this Borderless Creativity.        \n\nWhich is why our teams work fluidly across 5 capabilities Advertising, Experience, PR, Consulting and Health .   This allows us to not only operate but innovate at the intersection of capabilities and talent.  We believe impact and magic lies at this intersection.   Ogilvy scales this by seamlessly connecting and accessing the deep cultural expertise of 132 offices in 83 countries.   \n\nOur mission: We inspire brands and people to impact the world\n\nHow we do it : We innovate and operate at the intersection of people and capabilities\n\nWhat we do: Borderless creativity\n\nToday, Ogilvy is recognized as the world’s leading creative agency. We are also one of the most effective networks globally.\n\nAbout Memac Ogilvy\n\nMemac Ogilvy is one of the leading creative networks in MENA with its flagship office in the UAE and a strong local footprint in the GCC and North Africa. It is part of the formidable worldwide WPP & Ogilvy network. It’s the only truly integrated comms network – with Consulting, Advertising- Brand & Content, PR, Experience & Health under 1 P&L and under single leadership. Memac Ogilvy is the most integrated modern creative and effective partner for client growth in MENA. We inspire brands and people to impact the world. We deliver on this by combining expert and new capabilities for modern marketing solutions, with solid project management expertise for agile and effective delivery as well as a thorough and passionate People agenda.\n\nThe agency is the most awarded Middle Eastern agency in Cannes as well as a big winner at the local award show Lynx. It counts around 500 staff members.\n\nWhat We're Looking For\n\nWe are seeking a talented and creative Designer to join our PR team at Ogilvy. The ideal candidate will have strong skills in graphic design, animation, and digital asset creation. This role is pivotal in supporting our PR department with high-quality visual content for campaigns, presentations, and digital platforms.\n\nTo Succeed In This Role, You Need To\n\n\n* Graphic Design: Create compelling visual designs using Adobe Illustrator and Photoshop for various PR campaigns, social media, and digital platforms.\n* Animation: Develop engaging animations to support storytelling and promotional content using Adobe Premiere or other animation tools.\n* Digital Asset Creation: Produce a variety of digital assets, including infographics, social media graphics, web banners, and email templates.\n* Presentation Design: Design and enhance presentations for internal and external use, ensuring they are visually appealing and align with brand guidelines.\n* Collaboration: Work closely with the PR team to understand project requirements, provide creative input, and deliver high-quality design solutions.\n* Brand Consistency: Ensure all design outputs adhere to Ogilvy’s brand standards and contribute to a cohesive brand image.\n\n\n\nQualifications\n\n\n* Experience: Minimum of 2-3 years of experience in a similar role, preferably in an agency settings\n* Technical Skills: Proficiency in Adobe Illustrator, Adobe Photoshop, Adobe Premiere, and other relevant design and animation software.\n* Portfolio: A strong portfolio showcasing a range of design work, including graphic design, animation, and digital assets.\n* Soft Skills: Excellent communication skills, attention to detail, creativity, and the ability to work under tight deadlines.\n\n\n\nMemac Ogilvy inspires brands and people to impact the world. We exist to create iconic, culture-changing, value-driven ideas for our clients. \n\nBorderless Creativity is our lifeblood. We operate, innovate, and create at the intersection of our talented people, across advertising disciplines such as strategic thinking and distinctive idea creation, through a social-first approach — alongside our wider Memac Ogilvy family of Advertising, Experience, Health, Consulting and PR. Never have there been more opportunities available to communicate incredible ideas, impact culture, and influence consumer behavior. Paid advertising is a consistent, regular and controllable way of getting a business and brand’s core message in front of consumers in a way that no other medium can. Creativity is our greatest differentiator as we transcend the status quo and shift culture.\n\nHow We’ll Support You\n\nMemac Ogilvy celebrates its people. Fully. Enthusiastically. Unhesitatingly. We’ll empower you with the tools you’ll need to succeed. We’ll give you the autonomy to seek out new paths and better ways of doing things. We’ll support you with colleagues who are experts in their disciplines, drawn from across the Ogilvy network. And we’ll provide opportunities for you to do work of which you’ll be proud, with people you’ll be proud to call your teammates.\n\nOgilvy is an equal opportunity employer and considers applicants for all positions without regard to race, color, religion or belief, sex, age, national origin, citizenship status, marital status, military/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability. We believe in creating a dynamic work environment that values diversity and inclusion and strives to recruit a diverse slate of candidates to help us achieve that goal.\n\nAt Ogilvy, our people are at the heart of what we do: a creative agency that sparks game-changing ideas across culture and business through collaboration, integrity, and a celebration of self-expression.\n\nWe believe in building powerful teams with purpose. This means hiring and nurturing talent across all races, ethnicities, religions, abilities, sexual orientation, and gender identities – and we relentlessly curate transformative initiatives that make our commitment to fairness, and equity a reality.\n\nOur ultimate mission is to leave a positive impact on the world, creating a better future for all, while supporting and uplifting the global communities we serve. This is central to our mantra of Borderless Creativity.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nAt Ogilvy, our people are at the heart of what we do: a creative agency that sparks game-changing ideas across culture and business through collaboration, integrity, and a celebration of self-expression.\n\nWe believe in building powerful teams with purpose. This means hiring and nurturing talent across all races, ethnicities, religions, abilities, sexual orientation, and gender identities – and we relentlessly curate transformative initiatives that make our commitment to fairness, and equity a reality.\n\nOur ultimate mission is to leave a positive impact on the world, creating a better future for all, while supporting and uplifting the global communities we serve. This is central to our mantra of Borderless Creativity.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran."
  }
]